freetronics/ArduPhone-Software/BoardProfile/ArduPhone/boards.txt
arduphone.name=Freetronics ArduPhone

arduphone.upload.protocol=stk500
arduphone.upload.maximum_size=130048
arduphone.upload.speed=19200

arduphone.bootloader.low_fuses=0xFF
arduphone.bootloader.high_fuses=0xDA
arduphone.bootloader.extended_fuses=0xFF
arduphone.bootloader.path=atmega
arduphone.bootloader.file=optiboot_atmega1284p_8mhz.hex
arduphone.bootloader.unlock_bits=0x3F
arduphone.bootloader.lock_bits=0x0F

arduphone.build.mcu=atmega1284p
arduphone.build.f_cpu=8000000L
arduphone.build.core=arduino:arduino
#arduphone.build.core=standard
arduphone.build.variant=arduphone

